[
  {
    "id": 1,
    "author": "J.K. Rowling",
    "title": "Harry Potter and the Sorcerer's Stone",
    "rating": 4.2,
    "image": "/images/Rectangle1.jpeg",
    "viewed": false,
    "downloads": 1000000,
    "description": "For the first time in his life, Harry Potter learns that he is not an ordinary boy. He is a wizard, and his parents were wizards. At the age of eleven, Harry goes to Hogwarts School of Witchcraft and Wizardry, where he makes new friends, learns a lot about the wizarding world, and begins to fight evil.",
    "review": "This is my all-time favorite book. It is magical, exciting, and inspiring."
  },
  {
    "id": 2,
    "author": "George Orwell",
    "title": "1984",
    "rating": 3.8,
    "image": "/images/Rectangle2.jpeg",
    "viewed": false,
    "downloads": 500000,
    "description": "In a dystopian future, a totalitarian regime controls every aspect of people's lives. Winston Smith, a low-ranking member of the ruling party, begins to question the oppressive system and seeks rebellion.",
    "review": "A thought-provoking and chilling portrayal of a possible future."
  },
  {
    "id": 3,
    "author": "Jane Austen",
    "title": "Pride and Prejudice",
    "rating": 4.5,
    "image": "/images/Rectangle3.jpeg",
    "viewed": false,
    "downloads": 800000,
    "description": "Set in the early 19th century, this classic novel explores the themes of love, class, and societal expectations. Elizabeth Bennet navigates the challenges of relationships and societal norms.",
    "review": "A timeless masterpiece that captures the nuances of human relationships."
  },
  {
    "id": 4,
    "author": "Mark Twain",
    "title": "The Adventures of Tom Sawyer",
    "rating": 4.0,
    "image": "/images/Rectangle4.jpeg",
    "viewed": false,
    "downloads": 300000,
    "description": "Follow the mischievous adventures of Tom Sawyer in the pre-Civil War era. From whitewashing a fence to exploring caves, Tom's escapades are both humorous and poignant.",
    "review": "An engaging and nostalgic journey into the world of childhood."
  },
  {
    "id": 5,
    "author": "J.R.R. Tolkien",
    "title": "The Hobbit",
    "rating": 3.5,
    "image": "/images/Rectangle5.jpeg",
    "viewed": false,
    "downloads": 700000,
    "description": "Bilbo Baggins, a hobbit, embarks on an unexpected adventure to reclaim treasure guarded by the fearsome dragon Smaug. Along the way, he discovers courage and friendship.",
    "review": "A captivating tale of bravery and discovery in the fantastical world of Middle-earth."
  },
  {
    "id": 6,
    "author": "Agatha Christie",
    "title": "Murder on the Orient Express",
    "rating": 4.8,
    "image": "/images/Rectangle6.jpeg",
    "viewed": false,
    "downloads": 400000,
    "description": "Renowned detective Hercule Poirot is aboard the luxurious Orient Express when a murder occurs. Poirot must unravel the mystery as he encounters an ensemble of intriguing characters.",
    "review": "A brilliant and suspenseful mystery with a surprising twist."
  },
  {
    "id": 7,
    "author": "Gabriel Garcia Marquez",
    "title": "One Hundred Years of Solitude",
    "rating": 3.7,
    "image": "/images/Rectangle7.jpeg",
    "viewed": false,
    "downloads": 600000,
    "description": "This magical realist novel follows the Buendía family in the fictional town of Macondo. Spanning generations, it explores the complex relationships and history of the family.",
    "review": "A mesmerizing and surreal journey through time and imagination."
  },
  {
    "id": 8,
    "author": "Herman Melville",
    "title": "Moby-Dick",
    "rating": 4.6,
    "image": "/images/Rectangle1.jpeg",
    "viewed": false,
    "downloads": 900000,
    "description": "Captain Ahab seeks revenge on the elusive white whale, Moby-Dick, leading his crew on a perilous journey. The novel explores themes of obsession and the consequences of unchecked ambition.",
    "review": "A profound and symbolic tale that delves into the complexities of human nature."
  },
  {
    "id": 9,
    "author": "Virginia Woolf",
    "title": "Mrs. Dalloway",
    "rating": 4.3,
    "image": "/images/Rectangle2.jpeg",
    "viewed": false,
    "downloads": 120000,
    "description": "Set in post-World War I London, the novel follows Clarissa Dalloway as she prepares for a party. The narrative weaves between characters, exploring their inner thoughts and emotions.",
    "review": "An introspective and beautifully crafted exploration of the human psyche."
  },
  {
    "id": 10,
    "author": "F. Scott Fitzgerald",
    "title": "The Great Gatsby",
    "rating": 4.9,
    "image": "/images/Rectangle3.jpeg",
    "viewed": false,
    "downloads": 800000,
    "description": "Jay Gatsby's extravagant parties in 1920s New York conceal his longing for the elusive Daisy Buchanan. The novel explores themes of wealth, love, and the American Dream.",
    "review": "A timeless classic that captures the essence of the Jazz Age."
  },
  {
    "id": 11,
    "author": "Leo Tolstoy",
    "title": "War and Peace",
    "rating": 4.1,
    "image": "/images/Rectangle4.jpeg",
    "viewed": false,
    "downloads": 950000,
    "description": "Set against the backdrop of the Napoleonic Wars, 'War and Peace' follows the lives of several aristocratic families in Russia. The novel explores themes of war, love, and destiny.",
    "review": "A monumental work of literature that offers profound insights into the human experience."
  },
  {
    "id": 12,
    "author": "Charles Dickens",
    "title": "A Tale of Two Cities",
    "rating": 4.4,
    "image": "/images/Rectangle5.jpeg",
    "viewed": false,
    "downloads": 700000,
    "description": "Set in London and Paris before and during the French Revolution, the novel explores themes of sacrifice, resurrection, and the struggle for justice.",
    "review": "A riveting tale of love and sacrifice in a tumultuous historical period."
  },
  {
    "id": 13,
    "author": "Harper Lee",
    "title": "To Kill a Mockingbird",
    "rating": 4.7,
    "image": "/images/Rectangle6.jpeg",
    "viewed": false,
    "downloads": 850000,
    "description": "Set in the American South during the 1930s, the novel addresses issues of racial injustice as seen through the eyes of Scout Finch, a young girl. Her father, Atticus Finch, defends a black man falsely accused of raping a white woman.",
    "review": "A powerful and enduring exploration of morality and compassion."
  },
  {
    "id": 14,
    "author": "Aldous Huxley",
    "title": "Brave New World",
    "rating": 3.9,
    "image": "/images/Rectangle7.jpeg",
    "viewed": false,
    "downloads": 600000,
    "description": "In a dystopian future, society is engineered for stability and conformity. The novel explores the consequences of a world where pleasure is prioritized over individuality and critical thinking.",
    "review": "A prophetic and cautionary tale that challenges societal norms."
  },
  {
    "id": 15,
    "author": "Ray Bradbury",
    "title": "Fahrenheit 451",
    "rating": 4.2,
    "image": "/images/Rectangle1.jpeg",
    "viewed": false,
    "downloads": 750000,
    "description": "In a future society where books are banned and 'firemen' burn any that are found, Guy Montag, a fireman, begins to question the oppressive regime and seeks knowledge and freedom.",
    "review": "A thought-provoking exploration of censorship and the power of literature."
  },
  {
    "id": 16,
    "author": "Jules Verne",
    "title": "Twenty Thousand Leagues Under the Sea",
    "rating": 4.5,
    "image": "/images/Rectangle2.jpeg",
    "viewed": false,
    "downloads": 680000,
    "description": "Captain Nemo and his submarine, the Nautilus, embark on a thrilling underwater journey. The novel explores the wonders of the ocean and the consequences of unchecked human activities.",
    "review": "A classic adventure that captures the allure and mystery of the sea."
  },
  {
    "id": 17,
    "author": "Ernest Hemingway",
    "title": "The Old Man and the Sea",
    "rating": 4.0,
    "image": "/images/Rectangle3.jpeg",
    "viewed": false,
    "downloads": 550000,
    "description": "An aging Cuban fisherman, Santiago, engages in an epic battle with a giant marlin. The novella explores themes of resilience, nature, and the human spirit.",
    "review": "A timeless and poignant tale of human perseverance in the face of nature's challenges."
  },
  {
    "id": 18,
    "author": "Mary Shelley",
    "title": "Frankenstein",
    "rating": 3.8,
    "image": "/images/Rectangle4.jpeg",
    "viewed": false,
    "downloads": 720000,
    "description": "Victor Frankenstein, a young scientist, creates a grotesque but sentient creature. The novel explores themes of creation, morality, and the consequences of unchecked ambition.",
    "review": "A groundbreaking work of gothic fiction that delves into the ethical dilemmas of scientific experimentation."
  },
  {
    "id": 19,
    "author": "Emily Bronte",
    "title": "Wuthering Heights",
    "rating": 4.3,
    "image": "/images/Rectangle5.jpeg",
    "viewed": false,
    "downloads": 890000,
    "description": "Set on the Yorkshire moors, the novel tells the passionate and tragic love story of Heathcliff and Catherine Earnshaw. It explores themes of revenge, obsession, and the supernatural.",
    "review": "An intense and haunting portrayal of destructive love and societal expectations."
  },
  {
    "id": 20,
    "author": "Arthur Conan Doyle",
    "title": "The Adventures of Sherlock Holmes",
    "rating": 4.6,
    "image": "/images/Rectangle6.jpeg",
    "viewed": false,
    "downloads": 920000,
    "description": "The brilliant detective Sherlock Holmes and his loyal friend Dr. John Watson solve a series of intriguing mysteries in Victorian London. Holmes's keen powers of deduction are unmatched.",
    "review": "Masterfully crafted mysteries that showcase the brilliance of Sherlock Holmes."
  },
  {
    "id": 21,
    "author": "H.G. Wells",
    "title": "The Time Machine",
    "rating": 3.7,
    "image": "/images/Rectangle7.jpeg",
    "viewed": false,
    "downloads": 480000,
    "description": "Inventor and adventurer, the Time Traveller, explores the distant future using his time machine. He encounters strange civilizations and witnesses the evolution of humanity.",
    "review": "A groundbreaking work of science fiction that explores the concept of time travel."
  },
  {
    "id": 22,
    "author": "Homer",
    "title": "The Odyssey",
    "rating": 4.4,
    "image": "/images/Rectangle1.jpeg",
    "viewed": false,
    "downloads": 850000,
    "description": "Odysseus embarks on a perilous journey home after the Trojan War. Along the way, he faces mythical creatures and divine challenges, testing his wit and resilience.",
    "review": "An epic poem that captures the heroism, cunning, and perseverance of Odysseus."
  },
  {
    "id": 23,
    "author": "Roald Dahl",
    "title": "Charlie and the Chocolate Factory",
    "rating": 4.8,
    "image": "/images/Rectangle2.jpeg",
    "viewed": false,
    "downloads": 780000,
    "description": "Charlie Bucket, a poor boy, wins a golden ticket to tour Willy Wonka's chocolate factory. The novel explores themes of imagination, morality, and the consequences of greed.",
    "review": "A delightful and whimsical tale that appeals to the child in all of us."
  },
  {
    "id": 24,
    "author": "Daphne du Maurier",
    "title": "Rebecca",
    "rating": 4.1,
    "image": "/images/Rectangle3.jpeg",
    "viewed": false,
    "downloads": 720000,
    "description": "Follow the story of a young bride who finds herself in the shadow of her husband's first wife, Rebecca. Mysterious events unfold at the imposing Manderley estate, revealing secrets and deceptions.",
    "review": "A haunting tale of love, jealousy, and the lingering presence of the past."
  },
  {
    "id": 25,
    "author": "J.D. Salinger",
    "title": "The Catcher in the Rye",
    "rating": 4.5,
    "image": "/images/Rectangle4.jpeg",
    "viewed": false,
    "downloads": 800000,
    "description": "Holden Caulfield narrates his experiences in New York City, grappling with the challenges of adolescence and societal expectations. The novel explores themes of identity, alienation, and rebellion.",
    "review": "A timeless exploration of teenage angst and the search for authenticity."
  },
  {
    "id": 26,
    "author": "Gabriel Garcia Marquez",
    "title": "Love in the Time of Cholera",
    "rating": 4.2,
    "image": "/images/Rectangle5.jpeg",
    "viewed": false,
    "downloads": 680000,
    "description": "Set in a Caribbean port town, this novel follows the enduring love between Florentino Ariza and Fermina Daza. It explores the complexities of love, time, and the human heart.",
    "review": "A beautifully crafted tale of passion and the enduring power of true love."
  },
  {
    "id": 27,
    "author": "George Orwell",
    "title": "Animal Farm",
    "rating": 4.7,
    "image": "/images/Rectangle6.jpeg",
    "viewed": false,
    "downloads": 900000,
    "description": "In this allegorical novella, animals on a farm rebel against their human owner to establish a utopian society. However, the pursuit of equality and justice takes unexpected turns.",
    "review": "A satirical and thought-provoking commentary on political power and corruption."
  },
  {
    "id": 28,
    "author": "Ayn Rand",
    "title": "Atlas Shrugged",
    "rating": 3.9,
    "image": "/images/Rectangle7.jpeg",
    "viewed": false,
    "downloads": 750000,
    "description": "Set in a dystopian future, this novel explores the consequences of government intervention and the power of individualism. The story follows a group of individuals who resist a society that stifles innovation.",
    "review": "A philosophical and controversial exploration of individual rights and capitalism."
  },
  {
    "id": 29,
    "author": "Haruki Murakami",
    "title": "Norwegian Wood",
    "rating": 4.4,
    "image": "/images/Rectangle1.jpeg",
    "viewed": false,
    "downloads": 820000,
    "description": "Toru Okada reflects on his college years and relationships, particularly his love for Naoko and Midori. The novel delves into themes of loss, nostalgia, and the complexities of human connections.",
    "review": "A beautifully melancholic and introspective journey through love and loss."
  },
  {
    "id": 30,
    "author": "Isabel Allende",
    "title": "The House of the Spirits",
    "rating": 4.6,
    "image": "/images/Rectangle2.jpeg",
    "viewed": false,
    "downloads": 700000,
    "description": "This multi-generational novel follows the Trueba family in an unnamed South American country. It incorporates magical realism to explore social, political, and familial dynamics over the decades.",
    "review": "An enchanting and sweeping tale that intertwines the personal and the political."
  }
]
